selenium_test/apachebench/request_software_manage_c10.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            9528

Document Path:          /#/software/manage
Document Length:        140 bytes

Concurrency Level:      10
Time taken for tests:   1.745 seconds
Complete requests:      1000
Failed requests:        0
Non-2xx responses:      1000
Total transferred:      384000 bytes
Total body sent:        229000
HTML transferred:       140000 bytes
Requests per second:    572.92 [#/sec] (mean)
Time per request:       17.454 [ms] (mean)
Time per request:       1.745 [ms] (mean, across all concurrent requests)
Transfer rate:          214.85 [Kbytes/sec] received
                        128.12 kb/s sent
                        342.97 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.5      1       3
Processing:     5   16   6.9     20      31
Waiting:        1    9   5.3      7      24
Total:          6   17   7.2     21      31

Percentage of the requests served within a certain time (ms)
  50%     21
  66%     22
  75%     22
  80%     23
  90%     24
  95%     26
  98%     28
  99%     28
 100%     31 (longest request)