selenium_test/apachebench/request_software_register_c100.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            9528

Document Path:          /#/sw/register 
Document Length:        890 bytes

Concurrency Level:      100
Time taken for tests:   1.059 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      1114000 bytes
HTML transferred:       890000 bytes
Requests per second:    943.88 [#/sec] (mean)
Time per request:       105.945 [ms] (mean)
Time per request:       1.059 [ms] (mean, across all concurrent requests)
Transfer rate:          1026.84 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    6   4.7      5      20
Processing:     8   97  62.4     63     264
Waiting:        2   55  40.7     41     167
Total:         22  103  63.5     67     265

Percentage of the requests served within a certain time (ms)
  50%     67
  66%     93
  75%    168
  80%    190
  90%    191
  95%    191
  98%    265
  99%    265
 100%    265 (longest request)